app/controllers/musics_controller.rb

  def select

    if params[:Theme] == "all"
      @musics = Music.all
      @status = "These are all the 1000 songs you should listen before you die!"
    else
      @musics = Music.where("Theme like ?", "%#{params[:Theme]}")
      @status = "#{@musics.size} songs found for this Theme"
---
SELECT "musics".* FROM "musics" WHERE (Theme like '%Heartbreak') ORDER BY Theme ASC
SELECT COUNT(*) FROM "musics" WHERE (Theme like '%Heartbreak')

    def set_music
      @music = Music.find(params[:id])
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", "1"]]